{"pageProps":{"urls":["/news/2024/07/11/solv-mev-mode-released","/news/2024/07/05/elsol-lst-released","/news/2024/05/27/epics-dao-sponsored-webx-2024"],"articles":[{"title":"Introducing the New 'solv MEV Mode' - Automating Solana Validator Operations and Optimizing Rewards","category":"Press Release","thumbnail":"/news/2024/07/11/solvMEVMode.jpg","date":"2024.07.11","content":"\nELSOUL LABO B.V. (Headquarters: Amsterdam, Netherlands, CEO: Fumitake Kawasaki) and Epics DAO, an organization established by ELSOUL LABO to support open-source software development and operate a Web3 NFT card game, are promoting innovation and sustainable development in blockchain technology through the development and operation of the open-source software \"solv\" for Solana blockchain validators. After 18 months of operation, its performance and reliability have been proven, and it is now widely used by many users on both the Solana mainnet and testnet.\n\nWe are pleased to announce the release of the new \"solv MEV Mode,\" which automates Solana validator operations and optimizes rewards.\n\n## Challenges in Solana Validator Operations\n\nAll activities on the Solana blockchain (Web3 applications, dApps, token transactions, etc.) are supported by validators worldwide. Currently, about 1,500 Solana mainnet validators are operational, many of which are managed by individuals.\n\nValidators are distributed globally and operate while balancing family and work responsibilities. Updates are required several times a week, but for validators in Japan, they often occur late at night, necessitating prompt action. Delays in updates can affect their trust score, resulting in penalties and impacting their rewards.\n\nFurthermore, validators need to manage voting and validation costs as well as rewards. The Solana blockchain operates on an epoch-based system, with evaluations and reward calculations occurring every epoch. However, since an epoch is not linked to a 24-hour cycle, regular management is challenging.\n\n## About the New \"solv MEV Mode\"\n\nThe new \"solv MEV Mode\" frees validators from daily SSH access to their nodes and enables automated reward maximization and compounding. The node's status is constantly monitored, and any anomalies are immediately notified via Discord, allowing validators to operate with peace of mind.\n\n**Key Features:**\n\n- **Automatic Updates:** Solv MEV Mode automatically updates the Solana validator client and solv software version, ensuring the latest version is always running.\n- **Monitoring:** It monitors the health and balance of validators and sends notifications to Discord if any anomalies are detected.\n- **Automatic Reward Harvesting:** Rewards are harvested just before the end of an epoch to optimize returns.\n- **Automatic Staking:** Harvested rewards are converted to LST (Liquid Staking Token - elSOL) and sent to the specified account.\n- **Enhanced Security:** By keeping the SOL balance of the validator node low and converting rewards to LST, it mitigates the risk of large SOL withdrawals and maintains high returns.\n\nFor more details on solv MEV Mode and configuration instructions, please refer to the following documentation:\n\nhttps://solv.epics.dev/en/doc/quickstart/solv-mev-mode/\n\n※ MEV stands for Maximum Extractable Value, which refers to the pursuit of as much profit as possible.\n\n## What is elSOL?\n\n![elSOL](/news/2024/07/05/elSOLlst.jpg)\n\nelSOL is a tokenized representation (LST: Liquid Staking Token) of a staking account based on a high-quality validator pool managed by the solv development team. This pool is composed of multiple experienced and high-quality validators, ensuring high validator scores and stability by performing software updates with no downtime. These validators operate with a user fee of 0%, providing an efficient and cost-effective staking solution.\n\nelSOL - SOLscan: https://solscan.io/token/ELSoL1owwMWQ9foMsutweCsMKbTPVBD9pFqxQGidTaMC\n\nelSOL utilizes the official Solana Stake Pool program, increasing the value of the underlying staking accounts after each epoch, which in turn increases the amount of SOL each elSOL represents.\n\nSolana Stake Pool Program: https://spl.solana.com/stake-pool\n\n## Why elSOL?\n\nThe main advantage of elSOL is its composability. Tokenized staking accounts can be used by any program that operates on tokens. This allows elSOL to integrate with other Solana DeFi protocols like Jupiter, providing various financial services.\n\nJupiter: https://jup.ag/swap/SOL-ELSoL1owwMWQ9foMsutweCsMKbTPVBD9pFqxQGidTaMC\n\nelSOL is also listed in liquidity pools on Orca, where you can stake SOL into elSOL and supply it to liquidity pools to maximize your rewards.\n\nOrca elSOL Liquidity Pool (LP): https://www.orca.so/pools?tokens=ELSoL1owwMWQ9foMsutweCsMKbTPVBD9pFqxQGidTaMC\n\nBy holding elSOL, you can retain an asset that increases in value relative to SOL while using almost any Solana program. This opens up new opportunities to leverage staked assets.\n\n## Benefits of Holding elSOL\n\n1. **Ensured Immediate Liquidity:** With elSOL, you can ensure immediate liquidity without waiting for the end of an epoch. For example, if you need 5 SOL to purchase an NFT, you can instantly swap elSOL for SOL, while the remaining elSOL continues to earn rewards.\n2. **Automatic MEV Reward Collection and Compounding:** elSOL automatically collects MEV rewards and compounds them, increasing its value relative to SOL. This is more efficient than manually collecting and reinvesting MEV rewards.\n\nCurrently, elSOL can be staked easily with just one command using the solv CLI. An elSOL application will soon be released, allowing staking via UI.\n\n## ELSOUL LABO and Epics DAO\n\nELSOUL LABO and Epics DAO's core teams are actively involved in open-source software development.\n\nThey operate two open-source software projects, \"solv\" and \"Skeet.\"\n\n![solv](/news/2024/03/12/solvEN.jpg)\n\n\"solv\" is an open-source tool simplifying the setup and operation of Solana validators and RPC nodes. To earn rewards as a blockchain validator, machine resources of proper specifications are needed, and validator software installation and setup should be completed per documentation, followed by several updates each week.\n\nWith \"solv,\" Solana validators can be easily launched with just three commands. Updates require only one command, utilizing the open-source nature so that a single person worldwide can manage the update, and others can download it. solv documentation: https://solv.epics.dev\n\n![Skeet](/news/2024/03/12/SkeetV2EN.jpg)\n\n\"Skeet\" is an open-source, serverless app development tool using TypeScript, offering a modern application framework for infrastructure management, rapid app development, AI support, and dApp/Web3 development.\n\nSkeet documentation: https://skeet.dev\n\nThe Skeet development team's paper, \"Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development,\" was presented at ENASE 2024, an international software engineering conference held in Angers, France, on April 28-29, 2024. Dr. James represented the team and received high acclaim for his presentation.\n\nENASE 2024: https://enase.scitevents.org\n\n![ENASE 2024 - Skeet](/news/2024/05/10/SkeetENASE2024ResearchPaperPublished.jpg)\n\n![ENASE 2024 - Skeet Dev](/news/2024/05/02/ENASEelsoulTeam.jpg)\n\nThis study proposes a lightweight serverless framework for modern AI-driven application development. The research was published in the conference proceedings and indexed in Google Scholar, Scopus, and other major databases, making it widely accessible to the research community.\n\n「Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development」 - SciTePress: https://www.scitepress.org/PublicationsDetail.aspx?ID=Rza3TGE30Xw=&t=1\n\n![ENASE 2024 - Skeet paper](/news/2024/04/24/ENASE2024AfterTheConference.jpg)\n\nWe will continue promoting innovation, engaging in open-source software development, and supporting the overall development environment of open-source projects.\n\n**Company Overview**\n\n- Name: ELSOUL LABO B.V.\n- CEOs: Fumitake Kawasaki, Shota Kishi\n- Business: Software research and development (AI, cloud, blockchain)\n- Founded: September 2020\n- Location: Weteringschans 165, 1017XD Amsterdam, Netherlands\n- Accreditations: WBSO (Advanced R&D) from the Dutch government, Google Cloud Build partner, ENASE2024 paper selection\n- URL: https://labo.elsoul.nl\n- Discord: https://discord.gg/H2HeqRq54J\n- Press Kit: https://labo.elsoul.nl/en/press-kits\n\n**DAO Overview**\n\n- DAO Name: Epics DAO\n- Founders: Fumitake Kawasaki, Shota Kishi\n- Business: Research, development, and operation of blockchain games for social impact\n- Founded: June 2022\n- Award: 5th place, Solana Summer Camp Hackathon 2022\n- URL: https://epics.dev\n- Twitter: https://twitter.com/EpicsDAO2\n- Discord: https://discord.gg/GmHYfyRamx\n\n※ This article is not intended for investment advice. The information contained in this article is based on the situation at the time of writing. Please check for the most current information. Always NFA/DYOR.\n"},{"title":"New Liquid Staking Token (LST) on Solana Chain, elSOL Released","category":"Press Release","thumbnail":"/news/2024/07/05/elSOLlst.jpg","date":"2024.07.05","content":"\nELSOUL LABO B.V. (Headquarters: Amsterdam, Netherlands, CEO: Fumitake Kawasaki) and Epics DAO, a Web3 NFT card game supporting open-source software development established by the company, are promoting blockchain technology innovation and sustainable development through the development and operation of the open-source tool \"solv\" for Solana blockchain validators. This tool has proven its performance and reliability through approximately one year of operation and is now widely used by many users on the Solana blockchain's mainnet and testnet.\n\nWe are pleased to announce the release of the new Liquid Staking Token (LST) \"elSOL\" on the Solana chain.\n\n## What is elSOL?\n\nelSOL is a tokenized representation of a staking account based on a high-quality validator pool managed by the solv development team. This pool is composed of multiple experienced and high-quality validators, ensuring high validator scores and stability by performing software updates with no downtime. These validators operate with a user fee of 0%, providing an efficient and cost-effective staking solution.\n\nelSOL - SOLscan: https://solscan.io/token/ELSoL1owwMWQ9foMsutweCsMKbTPVBD9pFqxQGidTaMC\n\nelSOL utilizes the official Solana Stake Pool program, increasing the value of the underlying staking accounts after each epoch, which in turn increases the amount of SOL each elSOL represents.\n\nSolana Stake Pool Program: https://spl.solana.com/stake-pool\n\n## Why elSOL?\n\nThe main advantage of elSOL is its composability. Tokenized staking accounts can be used by any program that operates on tokens. This allows elSOL to integrate with other Solana DeFi protocols like Jupiter, providing various financial services.\n\nJupiter: https://jup.ag/swap/SOL-ELSoL1owwMWQ9foMsutweCsMKbTPVBD9pFqxQGidTaMC\n\nelSOL is also listed in liquidity pools on Orca, where you can stake SOL into elSOL and supply it to liquidity pools to maximize your rewards.\n\nOrca elSOL Liquidity Pool (LP): https://www.orca.so/pools?tokens=ELSoL1owwMWQ9foMsutweCsMKbTPVBD9pFqxQGidTaMC\n\nBy holding elSOL, you can retain an asset that increases in value relative to SOL while using almost any Solana program. This opens up new opportunities to leverage staked assets.\n\n## Benefits of Holding elSOL\n\n1. **Ensured Immediate Liquidity:** With elSOL, you can ensure immediate liquidity without waiting for the end of an epoch. For example, if you need 5 SOL to purchase an NFT, you can instantly swap elSOL for SOL, while the remaining elSOL continues to earn rewards.\n2. **Automatic MEV Reward Collection and Compounding:** elSOL automatically collects MEV rewards and compounds them, increasing its value relative to SOL. This is more efficient than manually collecting and reinvesting MEV rewards.\n\nCurrently, elSOL can be staked easily with just one command using the solv CLI. An elSOL application will soon be released, allowing staking via UI.\n\nsolv: https://solv.epics.dev/en/\n\n## New Feature: About solv MEV Mode\n\nMEV stands for Maximum Extractable Value, referring to the pursuit of extracting as much profit as possible. solv features an MEV mode, allowing validators to easily configure settings to maximize their earnings.\n\nUsing the new MEV mode in solv, you can automate and manage rewards frequently, maximizing your earnings.\n\nThe epoch timer checks the state of epochs, which are revenue cycles, and executes appropriate tasks at the right times.\n\nThese tasks include collecting and redistributing rewards required for each epoch. MEV mode allows you to always convert the appropriate amount of SOL to elSOL and send it to a specified account, enabling you to automatically compound staking rewards effortlessly.\n\nFor more details, please refer to the release notes below.\n\nsolv v4.2.8 - Release Notes（GitHub）: https://github.com/EpicsDAO/solv/releases/tag/%40epics-dao%2Fsolv%404.2.8\n\n## ELSOUL LABO and Epics DAO\n\nELSOUL LABO and Epics DAO's core teams are actively involved in open-source software development.\n\nThey operate two open-source software projects, \"solv\" and \"Skeet.\"\n\n![solv](/news/2024/03/12/solvEN.jpg)\n\n\"solv\" is an open-source tool simplifying the setup and operation of Solana validators and RPC nodes. To earn rewards as a blockchain validator, machine resources of proper specifications are needed, and validator software installation and setup should be completed per documentation, followed by several updates each week.\n\nWith \"solv,\" Solana validators can be easily launched with just three commands. Updates require only one command, utilizing the open-source nature so that a single person worldwide can manage the update, and others can download it. solv documentation: https://solv.epics.dev/\n\n![Skeet](/news/2024/03/12/SkeetV2EN.jpg)\n\n\"Skeet\" is an open-source, serverless app development tool using TypeScript, offering a modern application framework for infrastructure management, rapid app development, AI support, and dApp/Web3 development.\n\nSkeet documentation: https://skeet.dev/\n\nThe Skeet development team's paper, \"Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development,\" was presented at ENASE 2024, an international software engineering conference held in Angers, France, on April 28-29, 2024. Dr. James represented the team and received high acclaim for his presentation.\n\nENASE 2024: https://enase.scitevents.org/\n\n![ENASE 2024 - Skeet](/news/2024/05/10/SkeetENASE2024ResearchPaperPublished.jpg)\n\n![ENASE 2024 - Skeet Dev](/news/2024/05/02/ENASEelsoulTeam.jpg)\n\nThis study proposes a lightweight serverless framework for modern AI-driven application development. The research was published in the conference proceedings and indexed in Google Scholar, Scopus, and other major databases, making it widely accessible to the research community.\n\n「Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development」 - SciTePress: https://www.scitepress.org/PublicationsDetail.aspx?ID=Rza3TGE30Xw=&t=1\n\n![ENASE 2024 - Skeet paper](/news/2024/04/24/ENASE2024AfterTheConference.jpg)\n\nWe will continue promoting innovation, engaging in open-source software development, and supporting the overall development environment of open-source projects.\n\n**Company Overview**\n\n- Name: ELSOUL LABO B.V.\n- CEOs: Fumitake Kawasaki, Shota Kishi\n- Business: Software research and development (AI, cloud, blockchain)\n- Founded: September 2020\n- Location: Weteringschans 165, 1017XD Amsterdam, Netherlands\n- Accreditations: WBSO (Advanced R&D) from the Dutch government, Google Cloud Build partner, ENASE2024 paper selection\n- URL: https://labo.elsoul.nl\n- Discord: https://discord.gg/H2HeqRq54J\n- Press Kit: https://labo.elsoul.nl/en/press-kits\n\n**DAO Overview**\n\n- DAO Name: Epics DAO\n- Founders: Fumitake Kawasaki, Shota Kishi\n- Business: Research, development, and operation of blockchain games for social impact\n- Founded: June 2022\n- Award: 5th place, Solana Summer Camp Hackathon 2022\n- URL: https://epics.dev\n- Twitter: https://twitter.com/EpicsDAO2\n- Discord: https://discord.gg/GmHYfyRamx\n\n※ This article is not intended for investment advice. The information contained in this article is based on the situation at the time of writing. Please check for the most current information. Always NFA/DYOR.\n"},{"title":"Epics DAO Announced as a Sponsor for WebX 2024! Special Ticket Discounts Available","category":"Press Release","thumbnail":"/news/2024/05/27/webx2024key.jpg","date":"2024.05.27","content":"\nELSOUL LABO B.V. (headquartered in Amsterdam, Netherlands, CEO: Fumitake Kawasaki), along with its initiative, Epics DAO, which supports open-source software development through a Web3 NFT card game, has announced its participation as a sponsor for WebX 2024.\n\n## About WebX 2024\n\n![WebX 2024](/news/2024/05/27/webx2024EN.jpg)\n\nWebX 2024 will feature companies involved in cryptocurrencies, blockchain, and other Web3 technologies. It brings together major players, entrepreneurs, investors, government officials, media representatives, and the general public from both Japan and abroad.\n\nWebX 2024: https://webx-asia.com/\n\nLast year's event, WebX 2023, saw a participation of 16,500 people, making it the largest cryptocurrency and Web3 conference in Japan, organized by Asia's leading cryptocurrency and Web3 media, CoinPost.\n\n![WebX 2023](/news/2024/05/27/webx2023EN.jpg)\n\nWebX 2024 is scheduled to be held on August 28 and 29, 2024, at The Prince Park Tower Tokyo in Tokyo.\n\nEpics DAO will also have a booth at the venue, where visitors will receive a special limited edition NFT card pack.\n\nAdditional benefits await Buidlers Collective NFT holders who visit our booth.\n\nWe have secured a discount code for WebX 2024 tickets as part of our sponsorship benefits. We invite you to use this opportunity to attend the event.\n\nDiscount code: spsr_Discount_elsoul\n\nTickets for WebX 2024 can be purchased at a 20% discount via the link below.\n\nhttps://webx-asia.com/ja/ticket/?lang=JA&promo=spsr_Discount_elsoul\n\n![WebX 2024 Sponsors](/news/2024/05/27/webx2024sponsors.jpg)\n\n## Social Contribution Web3 NFT Card Game \"Buidlers Guild\"\n\nThe limited NFT card packs available as prizes contain NFT cards that can be used in the Web3 trading card battle game \"Buidlers Guild\" under development on the Epics platform.\n\nThe limited NFT card pack available this time, the \"Buidlers Guild Alpha Limited Premium Pack,\" is an Alpha Series Selection Premium Pack. It includes essential cards effective for various deck builds and features exclusive designs available only during this period.\n\nFor more details, please visit the official website or official Discord server via the following links:\n\nEpics DAO Official Website: https://epics.dev/en/\n\nEpics DAO Official Discord Server: https://discord.gg/GmHYfyRamx/\n\n![Epics Platform Buidlers Guild](/news/2024/04/19/BuidlersGuildFeaturedCardsInAlphaInvestorEN.jpg)\n\n![Epics Platform Buidlers Guild](/news/2024/04/19/BuidlersGuildFeaturedCardsInAlphaDevEN.jpg)\n\n![Epics Platform Buidlers Guild](/news/2024/04/19/BuidlersGuildFeaturedCardsInAlphaDegenEN.jpg)\n\n## BDLC NFT Staking for \"No Loss Donation\"\n\n![Buidlers Collective No Loss Donation](/news/2024/05/13/NoLossDonationStakingMechanismEN.jpg)\n\nWhen you stake BDLC NFTs on the Epics platform, you earn $EPCT token rewards, and the same amount of $EPCT is donated to the open-source project being staked for, helping fund future development. This initiative leverages blockchain to achieve socially impactful NFT staking and the concept of \"No Loss Donation,\" which allows staking rewards to be donated without losing the principal amount.\n\nThe Buidlers Collective NFT was minted in June 2022 and is celebrating its 2nd anniversary this June. To commemorate this milestone, a snapshot and special gifts have been arranged, and an event is planned. Please check the official Discord server for more details.\n\nEpics DAO Official Discord Server: https://discord.gg/GmHYfyRamx/\n\n![Buidlers Collective 2nd Anniversary](/news/2024/05/13/BuidlersCollective2ndAnniversary20246.jpg)\n\n## Social Issues to be Solved by Epics DAO\n\nIn recent years, high-quality open-source software, which is predominantly free, has been adopted by 97% of companies, showing significant growth. However, as many projects are volunteer-driven, they often suffer from financial difficulties or a lack of resources, leading to inadequate maintenance. Consequently, over half of the software globally is at risk due to serious security vulnerabilities.\n\nThe Epics platform addresses this issue by providing appropriate incentives for development, funding, and PR - three crucial resources for projects. It promotes collaboration among community members with different roles, such as developers, investors, and marketing activists, with the aim of enhancing support for open-source software development, ensuring sustainable development, global software security, and further improving quality.\n\n![Epics Platform](/news/2024/03/12/EpicsPlatformEN.jpg)\n\nOn the Epics platform, contributions to open-source result in earning card packs that can be used in the NFT card game \"Buidlers Guild\". As the type of cards received varies with the nature of the work (development, investment, or publicity), it fosters a supportive community where everyone aids in clearing tasks. Even users who do not play the card game find value in obtaining card packs due to demand from players, and valuable cards can lead to advantageous trades on the market, making it a platform enjoyable for all positions.\n\nBy focusing on fun and play on the platform, a sustainable open-source development environment is created, leading to high-quality open-source software that can address various social issues. This positive cycle is what Epics DAO strives to achieve.\n\nWe look forward to your participation. For more details, please check the official Discord.\n\nEpics DAO Official Discord: https://discord.com/invite/GmHYfyRamx\n\n※ This article is not intended for investment advice. The information contained in this article is based on the situation at the time of writing. Please check for the most current information. Always NFA/DYOR.\n"}],"article":{"title":"ELSOUL LABO B.V. and Latitude.sh Announce Business Partnership to Enhance Solana Validator Operation Efficiency","category":"Press Release","thumbnail":"/news/2023/10/27/ELSOULxLatitude.png","content":"\nELSOUL LABO B.V. (CEO: Fumitake Kawasaki, Headquarters: Amsterdam, Netherlands, hereinafter \"ELSOUL LABO\") and Latitude.sh (CEO: Guilherme Soubihe Alberto, Headquarters: São Paulo, Brazil, hereinafter \"Latitude\") are pleased to announce a business partnership agreement aimed at enhancing the efficiency of Solana validator operations.\n\nThrough this business partnership, by combining the open-source tool \"solv\" developed by ELSOUL LABO, and the high-performance bare metal cloud servers provided by Latitude, it is aimed to significantly streamline the setup, operation, and upgrade processes of Solana validators, targeting further expansion, decentralization, and stabilization of the Solana blockchain.\n\n## Background and Purpose of the Business Collaboration\n\nIn recent years, blockchain technology has rapidly evolved, contributing to decentralization and security improvements. However, the technical knowledge required to enter as a blockchain validator has hindered further decentralization and the acquisition of more participants.\n\nELSOUL LABO developed the open-source tool \"solv\" to address this issue. Solv is designed to easily start Solana validators in just three steps, and updates can be completed with a single command. This innovation significantly lowers the entry barrier for validators, which is believed to lead to the expansion, decentralization, and stabilization of the Solana platform. Furthermore, solv significantly reduces the operating cost of multiple validators and resolves team resource issues. It also provides cost reduction support during multiple validator operations in enterprise support.\n\nOn the other hand, Latitude provides high-performance bare metal cloud servers that meet the high hardware requirements demanded by Solana blockchain validators. This allows Solana validators to operate at optimal performance and cost-efficiency.\n\nNoting the complementary nature of these technologies and services, ELSOUL LABO and Latitude jointly developed \"solv2\". Solv2 combines the operation support of solv with Latitude’s bare metal cloud servers to provide a solution that allows for a high-performance and cost-effective quick start of Solana validators.\n\nWith the view of further expanding, decentralizing, and enhancing the safety of the Solana blockchain, ELSOUL LABO and Latitude have established a new collaboration utilizing Latitude in infrastructure and solv in operations. Through this business collaboration, both companies aim to contribute to the dissemination and evolution of blockchain technology, and provide value to a broader range of users.\n\n## Details of the Business Collaboration\n\n![solv - Solana Validator Open Source Tool](/news/2023/10/27/solvEN.png)\n\nThe goal of this business collaboration is to significantly improve the setup, operation, and upgrade workflows of Solana validators by combining the open-source tool ‘solv’ developed by ELSOUL LABO, with the high-performance bare metal cloud servers provided by Latitude.\n\n### Efficient Operational Support by solv\n\nsolv is designed to simplify the setup of Solana validators, enabling validator launch in just three steps. Additionally, updates can be completed with a single command, significantly lowering the entry barrier to validators and realizing operational efficiency.\n\n### High-Performance Bare Metal Cloud by Latitude\n\nLatitude’s bare metal cloud servers meet the high hardware requirements, allowing for the operation of Solana validators with optimal performance and cost efficiency. A few clicks are all that’s needed to prepare a high-performance machine and get started quickly, making the operation of validators swift and efficient.\n\n### Collaboration between solv and Latitude\n\nBy integrating solv with Latitude's bare metal cloud servers, the setup and operation of validators become even more efficient. This collaboration facilitates cost reduction and rapid setup and operation of validators, contributing to further expansion, decentralization, and stabilization of the Solana blockchain.\n\nThrough such collaboration, ELSOUL LABO and Latitude aim to support the stable operation and expansion of the Solana blockchain, contributing to the overall development of the blockchain community.\n\n## Comments from Both Companies\n\n![Latitude - Ricardo Bortolansa](/news/2023/10/27/RicardoBortolansa.png)\n\n**Ricardo Bortolansa - Head of Sales @ Latitude.sh**\n\nAt Latitude.sh we are committed to enabling the success of the Web3 community all over the world by providing access to top tier computing and infrastructure across several locations. ELSOUL's approach to quickly set up Solana validators in our servers greatly supports our goals, which is why we are really looking forward to this collaboration opportunity.\n\n![ELSOUL - Fumitake Kawasaki](/news/2023/10/27/FumitakeKawasaki.png)\n\n**Fumitake Kawasaki - CEO @ ELSOUL LABO B.V.**\n\nLatitude, while being cost-effective, offers unparalleled quality, low latency, and high-spec bare metal cloud server resources globally. Moreover, they are instantly available with a few clicks, making it a simple 3-step process to launch a Solana validator by installing, activating, and running solv. The collaboration between Latitude and solv eliminates the entry barriers for Solana blockchain validators, enabling a sustainable operational setup. We have high expectations for this collaboration's potential, streamlining multi-validator operations and expanding to other chains.\n\n## Company Introduction\n\n![Latitude.sh](/news/2023/10/27/LatitudeSh.png)\n\n**Latitude.sh**\n\n**Website:** https://latitude.sh\n\n**Representative:** Guilherme Soubihe Alberto\n\n**Headquarters:** São Paulo, Brazil\n\n**Business Description:** Latitude.sh provides top-tier computing and infrastructure to leverage the true power of edge computing. Through a low-latency global network, powerful software and hardware are provided, operating thousands of physical nodes in more than 16 countries. Additionally, by offering bare metal cloud servers to support validator operations on blockchain networks like Solana, it contributes to the advancement of the blockchain community.\n\n![ELSOUL LABO B.V.](/news/2023/10/27/elsoulEN.png)\n\n**ELSOUL LABO B.V.**\n\n**Website:** https://labo.elsoul.nl\n\n**Representative:** Fumitake Kawasaki\n\n**Headquarters:** Amsterdam, Netherlands\n\n**Business Description:** ELSOUL LABO B.V. was established as a software laboratory to support the development and proliferation of open-source software utilizing blockchain technology. They have developed the serverless framework for Web3 apps, \"Skeet\", the socially contributive blockchain game \"Epics\", and the tool \"solv\" for efficient validator operations on the Solana blockchain, contributing to the proliferation and evolution of blockchain technology and open-source software. The Epics platform has been certified as an Advanced Science and Technology Research Project (WBSO) by the Dutch government.\n\nSkeet: https://skeet.dev\n\nEpics: https://epics.dev\n\nsolv: https://solv.epics.dev\n\n## Future Prospects\n\nELSOUL LABO and Latitude, through this business collaboration, plan to deepen their partnership towards further proliferation and evolution of blockchain technology, based on the synergy obtained. Especially, aiming for more efficient validator operations and further expansion and decentralization of the blockchain, they intend to continue joint technology development and community support. Both companies aim to maximize the potential of blockchain technology and provide new value to a broader range of users.\n\n## For inquiries regarding this matter\n\nFor inquiries regarding this matter, please contact us at the following contact information.\n\nEmail: labo@elsoul.nl\n\nDiscord: https://discord.gg/H2HeqRq54J\n\nTwitter (X): https://twitter.com/elsoul_labo2\n","date":"2023.10.27","id":"elsoul-latitude-business-collaboration-enhance-solana-validator"},"articleHtml":"<p>ELSOUL LABO B.V. (CEO: Fumitake Kawasaki, Headquarters: Amsterdam, Netherlands, hereinafter \"ELSOUL LABO\") and Latitude.sh (CEO: Guilherme Soubihe Alberto, Headquarters: São Paulo, Brazil, hereinafter \"Latitude\") are pleased to announce a business partnership agreement aimed at enhancing the efficiency of Solana validator operations.</p>\n<p>Through this business partnership, by combining the open-source tool \"solv\" developed by ELSOUL LABO, and the high-performance bare metal cloud servers provided by Latitude, it is aimed to significantly streamline the setup, operation, and upgrade processes of Solana validators, targeting further expansion, decentralization, and stabilization of the Solana blockchain.</p>\n<h2 id=\"background-and-purpose-of-the-business-collaboration\" class=\"font-extrabold tracking-tighter break-word\">Background and Purpose of the Business Collaboration</h2>\n<p>In recent years, blockchain technology has rapidly evolved, contributing to decentralization and security improvements. However, the technical knowledge required to enter as a blockchain validator has hindered further decentralization and the acquisition of more participants.</p>\n<p>ELSOUL LABO developed the open-source tool \"solv\" to address this issue. Solv is designed to easily start Solana validators in just three steps, and updates can be completed with a single command. This innovation significantly lowers the entry barrier for validators, which is believed to lead to the expansion, decentralization, and stabilization of the Solana platform. Furthermore, solv significantly reduces the operating cost of multiple validators and resolves team resource issues. It also provides cost reduction support during multiple validator operations in enterprise support.</p>\n<p>On the other hand, Latitude provides high-performance bare metal cloud servers that meet the high hardware requirements demanded by Solana blockchain validators. This allows Solana validators to operate at optimal performance and cost-efficiency.</p>\n<p>Noting the complementary nature of these technologies and services, ELSOUL LABO and Latitude jointly developed \"solv2\". Solv2 combines the operation support of solv with Latitude’s bare metal cloud servers to provide a solution that allows for a high-performance and cost-effective quick start of Solana validators.</p>\n<p>With the view of further expanding, decentralizing, and enhancing the safety of the Solana blockchain, ELSOUL LABO and Latitude have established a new collaboration utilizing Latitude in infrastructure and solv in operations. Through this business collaboration, both companies aim to contribute to the dissemination and evolution of blockchain technology, and provide value to a broader range of users.</p>\n<h2 id=\"details-of-the-business-collaboration\" class=\"font-extrabold tracking-tighter break-word\">Details of the Business Collaboration</h2>\n<p><img src=\"/news/2023/10/27/solvEN.png\" alt=\"solv - Solana Validator Open Source Tool\"></p>\n<p>The goal of this business collaboration is to significantly improve the setup, operation, and upgrade workflows of Solana validators by combining the open-source tool ‘solv’ developed by ELSOUL LABO, with the high-performance bare metal cloud servers provided by Latitude.</p>\n<h3 id=\"efficient-operational-support-by-solv\" class=\"font-extrabold tracking-tighter break-word\">Efficient Operational Support by solv</h3>\n<p>solv is designed to simplify the setup of Solana validators, enabling validator launch in just three steps. Additionally, updates can be completed with a single command, significantly lowering the entry barrier to validators and realizing operational efficiency.</p>\n<h3 id=\"high-performance-bare-metal-cloud-by-latitude\" class=\"font-extrabold tracking-tighter break-word\">High-Performance Bare Metal Cloud by Latitude</h3>\n<p>Latitude’s bare metal cloud servers meet the high hardware requirements, allowing for the operation of Solana validators with optimal performance and cost efficiency. A few clicks are all that’s needed to prepare a high-performance machine and get started quickly, making the operation of validators swift and efficient.</p>\n<h3 id=\"collaboration-between-solv-and-latitude\" class=\"font-extrabold tracking-tighter break-word\">Collaboration between solv and Latitude</h3>\n<p>By integrating solv with Latitude's bare metal cloud servers, the setup and operation of validators become even more efficient. This collaboration facilitates cost reduction and rapid setup and operation of validators, contributing to further expansion, decentralization, and stabilization of the Solana blockchain.</p>\n<p>Through such collaboration, ELSOUL LABO and Latitude aim to support the stable operation and expansion of the Solana blockchain, contributing to the overall development of the blockchain community.</p>\n<h2 id=\"comments-from-both-companies\" class=\"font-extrabold tracking-tighter break-word\">Comments from Both Companies</h2>\n<p><img src=\"/news/2023/10/27/RicardoBortolansa.png\" alt=\"Latitude - Ricardo Bortolansa\"></p>\n<p><strong>Ricardo Bortolansa - Head of Sales @ Latitude.sh</strong></p>\n<p>At Latitude.sh we are committed to enabling the success of the Web3 community all over the world by providing access to top tier computing and infrastructure across several locations. ELSOUL's approach to quickly set up Solana validators in our servers greatly supports our goals, which is why we are really looking forward to this collaboration opportunity.</p>\n<p><img src=\"/news/2023/10/27/FumitakeKawasaki.png\" alt=\"ELSOUL - Fumitake Kawasaki\"></p>\n<p><strong>Fumitake Kawasaki - CEO @ ELSOUL LABO B.V.</strong></p>\n<p>Latitude, while being cost-effective, offers unparalleled quality, low latency, and high-spec bare metal cloud server resources globally. Moreover, they are instantly available with a few clicks, making it a simple 3-step process to launch a Solana validator by installing, activating, and running solv. The collaboration between Latitude and solv eliminates the entry barriers for Solana blockchain validators, enabling a sustainable operational setup. We have high expectations for this collaboration's potential, streamlining multi-validator operations and expanding to other chains.</p>\n<h2 id=\"company-introduction\" class=\"font-extrabold tracking-tighter break-word\">Company Introduction</h2>\n<p><img src=\"/news/2023/10/27/LatitudeSh.png\" alt=\"Latitude.sh\"></p>\n<p><strong>Latitude.sh</strong></p>\n<p><strong>Website:</strong> <a href=\"https://latitude.sh\" target=\"_blank\" rel=\"noopener noreferrer\">https://latitude.sh</a></p>\n<p><strong>Representative:</strong> Guilherme Soubihe Alberto</p>\n<p><strong>Headquarters:</strong> São Paulo, Brazil</p>\n<p><strong>Business Description:</strong> Latitude.sh provides top-tier computing and infrastructure to leverage the true power of edge computing. Through a low-latency global network, powerful software and hardware are provided, operating thousands of physical nodes in more than 16 countries. Additionally, by offering bare metal cloud servers to support validator operations on blockchain networks like Solana, it contributes to the advancement of the blockchain community.</p>\n<p><img src=\"/news/2023/10/27/elsoulEN.png\" alt=\"ELSOUL LABO B.V.\"></p>\n<p><strong>ELSOUL LABO B.V.</strong></p>\n<p><strong>Website:</strong> <a href=\"https://labo.elsoul.nl\" target=\"_blank\" rel=\"noopener noreferrer\">https://labo.elsoul.nl</a></p>\n<p><strong>Representative:</strong> Fumitake Kawasaki</p>\n<p><strong>Headquarters:</strong> Amsterdam, Netherlands</p>\n<p><strong>Business Description:</strong> ELSOUL LABO B.V. was established as a software laboratory to support the development and proliferation of open-source software utilizing blockchain technology. They have developed the serverless framework for Web3 apps, \"Skeet\", the socially contributive blockchain game \"Epics\", and the tool \"solv\" for efficient validator operations on the Solana blockchain, contributing to the proliferation and evolution of blockchain technology and open-source software. The Epics platform has been certified as an Advanced Science and Technology Research Project (WBSO) by the Dutch government.</p>\n<p>Skeet: <a href=\"https://skeet.dev\" target=\"_blank\" rel=\"noopener noreferrer\">https://skeet.dev</a></p>\n<p>Epics: <a href=\"https://epics.dev\" target=\"_blank\" rel=\"noopener noreferrer\">https://epics.dev</a></p>\n<p>solv: <a href=\"https://solv.epics.dev\" target=\"_blank\" rel=\"noopener noreferrer\">https://solv.epics.dev</a></p>\n<h2 id=\"future-prospects\" class=\"font-extrabold tracking-tighter break-word\">Future Prospects</h2>\n<p>ELSOUL LABO and Latitude, through this business collaboration, plan to deepen their partnership towards further proliferation and evolution of blockchain technology, based on the synergy obtained. Especially, aiming for more efficient validator operations and further expansion and decentralization of the blockchain, they intend to continue joint technology development and community support. Both companies aim to maximize the potential of blockchain technology and provide new value to a broader range of users.</p>\n<h2 id=\"for-inquiries-regarding-this-matter\" class=\"font-extrabold tracking-tighter break-word\">For inquiries regarding this matter</h2>\n<p>For inquiries regarding this matter, please contact us at the following contact information.</p>\n<p>Email: <a href=\"mailto:labo@elsoul.nl\">labo@elsoul.nl</a></p>\n<p>Discord: <a href=\"https://discord.gg/H2HeqRq54J\" target=\"_blank\" rel=\"noopener noreferrer\">https://discord.gg/H2HeqRq54J</a></p>\n<p>Twitter (X): <a href=\"https://twitter.com/elsoul_labo2\" target=\"_blank\" rel=\"noopener noreferrer\">https://twitter.com/elsoul_labo2</a></p>","title":"ELSOUL LABO B.V. and Latitude.sh Announce Business Partnership to Enhance Solana Validator Operation Efficiency | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes","seoData":[{"property":"og:title","content":"ELSOUL LABO B.V. and Latitude.sh Announce Business Partnership to Enhance Solana Validator Operation Efficiency | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes"},{"name":"twitter:title","content":"ELSOUL LABO B.V. and Latitude.sh Announce Business Partnership to Enhance Solana Validator Operation Efficiency | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes"},{"name":"twitter:text:title","content":"ELSOUL LABO B.V. and Latitude.sh Announce Business Partnership to Enhance Solana Validator Operation Efficiency | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes"},{"name":"description","content":"\nELSOUL LABO B.V. (CEO: Fumitake Kawasaki, Headquarters: Amsterdam, Netherlands, hereinafter \"ELSOUL LABO\") and Latitude ..."},{"property":"og:description","content":"\nELSOUL LABO B.V. (CEO: Fumitake Kawasaki, Headquarters: Amsterdam, Netherlands, hereinafter \"ELSOUL LABO\") and Latitude ..."},{"name":"twitter:description","content":"\nELSOUL LABO B.V. (CEO: Fumitake Kawasaki, Headquarters: Amsterdam, Netherlands, hereinafter \"ELSOUL LABO\") and Latitude ..."},{"property":"og:url","content":"https://solv.epics.dev/en/news/2023/10/27/elsoul-latitude-business-collaboration-enhance-solana-validator"},{"property":"og:image","content":"https://solv.epics.dev/news/2023/10/27/ELSOULxLatitude.png"},{"property":"og:image:secure","content":"https://solv.epics.dev/news/2023/10/27/ELSOULxLatitude.png"},{"name":"twitter:image","content":"https://solv.epics.dev/news/2023/10/27/ELSOULxLatitude.png"}],"_nextI18Next":{"initialI18nStore":{"en":{"common":{"contactToTeam":"Talk with Team","privacy":"Privacy","404title":"Page not found","404body":"Sorry, we couldn't find the page you're looking for.","backToTop":"Back to top page","toc":"Table of Contents","openMenu":"Open menu","closeMenu":"Close menu","media":"Media","news":"News","books":"Books","copy":"Copy","copied":"Copied!","solvInstall":"Install solv","updateSettings":"Update settings","setupSolv":"Setup","thatsAll":"That's all!","navs":{"defaultMainNav":{"quickstart":"Quickstart","news":"News","doc":"Docs","dao":"DAO","enterprise":"Enterprise","contact":"Contact"},"commonFooterNav":{"quickstart":"Quickstart","news":"News","doc":"Docs","enterprise":"Enterprise","dao":"DAO","contact":"Contact","privacy":"Privacy","press-kits":"Press Kits"}},"AgreeToPolicy":{"title":"Your Choices Regarding Cookies","body":"We and our third party partners use cookies and similar technologies to process certain information, such as your IP address and digital identifiers, to analyze site usage and provide you better experiences. Please read our privacy policy for the detail.","yes":"Yes, I Accept","no":"No, I Do Not Accept"},"ContactRow":{"discord":{"title":"Community Discord","body":"If you have any inquiries, please create a support ticket in the community Discord.","button":"JOIN"},"form":{"title":"Talk with Team","body":"If you have any inquiries about development and support, please get in touch with us from here.","button":"Go"}},"CTASectionRow":{"title":"The utility tool for Solana Validators","body":"solv is an open-source tool designed to simplify the setup and operation of Solana validators and RPC nodes.","button":"Get Started","demo":"Try Demo"},"WhyOpenSourceDevelopmentRow":{"subtitle":"Why Open-Source Software?","title":"Sustainable technology development and benefits for society as a whole","description":"Open-source software (OSS) development drives technological progress in modern society and enables new value creation.","feature1":{"title":"Value as a public good","description":"Open-source software is free for anyone to use, improve, and redistribute. This makes OSS a public good for all mankind. People all over the world can enjoy its value without feeling financially constrained. As a result, innovation across society will be driven, and the equality and inclusiveness of the digital society will increase."},"feature2":{"title":"Global cooperation","description":"In the world of OSS, developers all over the world work together to improve software beyond the boundaries of regions and organizations. Each person's perspective and expertise can be incorporated into the project, enhancing its quality. OSS is truly a global gathering place of knowledge and experience that consistently produces high-quality software."},"feature3":{"title":"Preventing reinvention of the wheel","description":"OSS allows us to reuse code and prevents us from reinventing the wheel. As a result, developers can focus less on creating everything from scratch and more on solving specific problems and developing new features. This increases efficiency and enables faster higher-quality results."}},"RoadmapRow":{"2022.6":"Epics Lite Paper, TGE (Token Generate Event)","2022.7":"Epics GENESIS presale","2022.8":"Epics White Paper v1","2022.9":"Epics Alpha launch, Solana Summer Camp Hackathon 5th prize","2022.10":"Presale for IDO, WBSO (Advanced R&D) certified by the Dutch government","2022.11":"Solana Breakpoint, GitHub issue Data Oracle Collaborative Development (DIA)","2023.1":"IDO $EPCT on Orca (Solana DEX)","2023.4":"Epics DAO became a Solana Testnet Validator","2023.9":"Seed Extension Round Fundraising","2023.12":"Epics Platform Beta Launch","2024.2":"$EPCT Listed on Meteora (Solana DEX)","2024.4":"NFT Card Design Reveal, NICONICO CHOKAIGI 2024, ENASE 2024","2024.5":"Epics DAO became a Solana mainnet validator","2024.8":"NFT Card Game β Test Begins, WebX 2024","2024.10":"Series A fundraising, EPCD Exchange Launch","2025.4":"Major Release of Epics Platform, General Release of the NFT Card Game","2025.9":"Series B Fundraising","2026.4":"IEO $EPCT"},"OurWorksRow":{"WBSO":{"title":"WBSO accreditation from the Dutch government","description":"Epics DAO has received WBSO (Advanced Science and Technology Research) accreditation from the Dutch government. Epics is a social contribution blockchain game (BCG) that aims to realize a sustainable open-source development environment."},"SolanaValidator":{"title":"We operate a validator for the Solana blockchain","description":"As a validator on the Solana chain, Epics DAO is committed to ensuring the reliability and stability of the network. We will also contribute to the technical aspects of achieving Solana's fast and stable network."},"SolanaSummerCamp":{"title":"Placed 5th at Solana Summer Camp Hackathon 2022","description":"Epics DAO won 5th place out of over 18,000 entries at the Solana Summer Camp Hackathon held July 11-August 16, 2022."},"GoogleWeb3":{"title":"ELSOUL LABO has been certified by Google Web3 Startups program","description":"ELSOUL LABO's activities in the Web3 sector, including Epics DAO, and support for open-source development initiatives such as solv and Skeet, have been recognized and selected for the Google Cloud Web3 Startups program."},"ENASE2024":{"title":"Research Paper on AI & Serverless 'Skeet' Accepted for ENASE 2024","description":"The research paper 'Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development' has been accepted for presentation at the international conference on software engineering, ENASE 2024."},"CHOKAIGI2024":{"title":"Epics DAO Exhibits at CHOKAIGI 2024","description":"Epics DAO exhibited at CHOKAIGI 2024, held on April 27th - 28th, 2024, distributing limited edition NFTs and more. With a total attendance of 125,362 visitors, the event concluded successfully."},"WebX2024":{"title":"Epics DAO is a WebX 2024 Sponsor","description":"WebX 2024 is the largest event in Asia focused on cutting-edge technologies in Web3, including cryptocurrencies and blockchain. It is the only conference where government bodies, established companies, IP firms, and Web3 businesses can interact."}},"SolvTutorialYouTubeRow":{"title":"Complete Guide to Solana Validators","subtitle":"YouTube Tutorial","description":"We have released a comprehensive guide to easily start operating a Solana validator using solv. For those already running a Solana validator, you can easily switch to solv to benefit from no-downtime transitions and accelerated snapshot downloads."},"SolanaBreakpointSideEventRow":{"title":"Solana Validator Hands-On Workshop","description":"Join us to explore the realm of Solana Validators! This beginner-friendly workshop allows you to launch a Solana Validator using Latitude's cloud servers. Validators process transactions and secure the network, earning rewards. You'll get hands-on experience, unraveling the operational essence of validators while enjoying event-exclusive free credits. It's a chance to learn, interact, and dive into the incentivized world of Solana Validators. Looking forward to engaging in discussions. See you there!","link":"Event Detail"},"LatitudeCouponRow":{"subtitle":"Try it now on Bare Metal Cloud","title":"Latitude Trial Credit Coupon","description":"Through our partnership with Latitude, we are now able to offer a $100 credit coupon. By utilizing this coupon, you can actually try out launching a Solana validator with solv at hand right now.","register":"Register Coupon","couponCode":"Coupon Code"},"StakeForOpenSourceRow":{"subtitle":"Stake for the future of Open-Source Development","title":"Let's support Open-Source Development while earning staking rewards.","description":"※ These are not intended for investment advice. The information are based on the situation at the time of writing. Please check for the most current information. Always NFA/DYOR.","feature1":{"title":"Solana Mainnet Validator","description":"Epics DAO operates a Solana mainnet validator with a 0% fee for users who stake their SOL tokens, resulting in a stake reward with an annual percentage rate (APR) of 7.58% as of May 16, 2024. To contribute to the decentralization of the Solana network and enable innovation worldwide, we will focus our operations in areas with fewer nodes and data centers.","button":"Go to Validator Detail"},"feature2":{"title":"Buidlers Collective (BDLC) NFT","description":"When you stake BDLC NFTs on the Epics platform, you can earn $EPCT token rewards. Additionally, an equivalent amount of $EPCT is donated to the open-source project where the NFTs are staked, to be used for future development. This initiative utilizes blockchain technology to enable socially beneficial NFT staking and No Loss Donation, where staking rewards are donated without losing the principal.","button":"Go to NFT Marketplace"}},"NicoNicoChoKaigi2024Row":{"subtitle":"Cho Dice Roll in NICONICO CHOKAIGI 2024","title":"Thank you for visiting!","description":"Epics DAO participated in Nico Nico Chokaigi 2024, held at Makuhari Messe on April 27th and 28th, and distributed limited edition NFTs to visitors. The event attracted a total of 125,362 attendees, with about 3,000 people visiting the Epics DAO Cho Dice Roll booth, successfully concluding the event with great fanfare."},"WebX2024Row":{"title":"WebX 2024 Sponsor Confirmed","description":"Epics DAO will participate as a sponsor at WebX 2024. WebX is the largest event in Asia focused on cutting-edge technologies in Web3, including cryptocurrencies and blockchain. It is the only conference where government bodies, established companies, IP firms, and Web3 businesses can interact.","discountLink":"Sponsor Discount Tickets"}},"news":{"title":"News","body":"From solv Dev"}}},"initialLocale":"en","ns":["common","news"],"userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ja"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ja"]}}}}},"__N_SSG":true}