{"pageProps":{"article":{"title":"Privacy policy","description":"Privacy Policy","content":"\n## A. Introduction\n\n1.  The privacy of our users is very important to us and we are committed to protecting it. This policy describes how we handle your personal information.\n2.  By agreeing to use cookies in accordance with the terms of this policy the first time you visit this website, you consent to the use of cookies each time you visit the installation.\n\n## B. Acknowledgments\n\nThis document was created using the SEQ Legal (seqlegal.com) template and modified by [ELSOUL LABO (labo.elsoul.nl).](http://labo.elsoul.nl)\n\n## C. Collection of personal information\n\nThe following types of personal information may be collected, stored and used.\n\n1.  Information about your computer, such as IP address, geographic location, browser type and version, operating system, and more.\n2.  Information about accessing and using this website, such as source, time of visit, page views, and website navigation paths.\n3.  Information such as your e-mail address that you enter when registering on this site.\n4.  Information to be entered when creating a profile on this site, such as name, profile picture, gender, date of birth, dating status such as married / unmarried, interests and hobbies, educational background, work history.\n5.  Information such as the name and email address you enter to subscribe to emails and newsletters.\n6.  Information to enter while using the service on this site.\n7.  Information generated while using this site. Includes information such as when, how often, and under what circumstances.\n8.  Information about what you purchased, the services you used, or the transactions you made through this site. Includes name, address, phone number, email address and credit card details.\n9.  Information that customers post on this site for the purpose of publishing it on the Internet. Includes username, profile picture, and posted content.\n10. Information contained in communications you send to us via email or this site. Includes communication content and metadata.\n11. Other personal information you send to us.\n\nBefore you disclose the personal information of another person to us, you must obtain that person's consent for both the disclosure and processing of that personal information in accordance with this policy.\n\n## D. Use of personal information\n\nPersonal information sent to us through this site will be used for the purposes specified in this policy or related pages of the website. We may use your personal information for the following purposes.\n\n1.  For management of this site and management of business.\n2.  To personalize our site for you.\n3.  To enable the use of services available on this site.\n4.  To send products purchased from this site.\n5.  To provide services purchased through this site.\n6.  To send statements, invoices, payment notices and accept payments.\n7.  To send communications for non-marketing purposes.\n8.  To send email notifications requested by you.\n9.  If you request, we will send you a newsletter by email (you can unsubscribe at any time when you no longer need the newsletter).\n10. To send marketing related to our business or the business of a carefully selected third party that you may be interested in by mail or, if you specifically agree to this, by email or similar technology. (Please contact us whenever you no longer need marketing communications).\n11. To provide statistical information about users of this site to third-party businesses (however, third-party businesses cannot identify users from that information).\n12. To respond to inquiries and complaints from customers related to this site.\n13. To keep our site safe and prevent fraud.\n14. To verify compliance with the Terms of Service governing the use of this site (including monitoring private messages sent through our private messaging services).\n15. Other uses.\n\nPrivacy settings can be used to limit the disclosure of information on this site and can be adjusted using the privacy controls of the website. We will not provide your personal information to third parties or other third parties for direct marketing without your explicit consent.\n\n## E. Disclosure of personal information\n\nWe may disclose personal information to employees, officers, insurance companies, professional advisors, agents, suppliers, or subcontractors if reasonably necessary for the purposes described in this policy. We may disclose personal information to members of the Group (that is, subsidiaries, ultimate holding companies, and all of them) if reasonably necessary for the purposes described in this policy.\n\n1.  To the extent required by law\n2.  If related to ongoing or future legal proceedings\n3.  To establish, exercise, or defend our legal rights (including providing information to others to prevent fraud and reduce credit risk).\n4.  To purchasers (or prospective buyers) of businesses or assets that we sell (or are considering selling)\n5.  In our reasonable opinion, we reasonably believe that such courts or authorities may apply to the court or other competent authority to disclose their personal information if it may reasonably decide to disclose it. To the person\n\nWe may disclose personal information.\n\nWe will not provide your personal information to third parties except as provided in this policy.\n\n## F. International data communication\n\n1.  The information we collect may be stored, processed and transferred in any of the countries in which we operate in order to make the information available in accordance with this policy.\n2.  The information we collect may be transferred to the following countries that do not have data protection laws equivalent to those enforced in European economies: United States, Russia, Japan, China, India.\n3.  Personal information published on this site or personal information sent for publication on this site may be available worldwide via the Internet. We cannot prevent the use or misuse of such information by others.\n\n## G. Retention of personal information\n\n1.  Section G sets out data retention policies and procedures designed to ensure compliance with our legal obligations regarding the retention and deletion of personal information.\n2.  Personal information that we process for any purpose will not be retained for longer than that purpose or the period required for those purposes.\n3.  We generally remove personal information that falls into the categories specified below at the dates and times specified below without violating Section G2. 1. Personal information will be deleted after half a year.\n4.  Notwithstanding the other provisions of Section G\n5.  To the extent required by law\n6.  If the document appears to be related to ongoing or future legal proceedings, and\n7.  To establish, exercise or defend our legal rights (including providing information to others to prevent fraud and reduce credit risk). We hold documents containing personal information (including electronic documents).\n\n## H. Security of personal information\n\n1.  We will take reasonable technical and systematic precautions to prevent the loss, misuse, or falsification of your personal information.\n2.  All personal information provided by you is stored on a secure (password and firewall protected) server.\n3.  All electronic financial transactions made through this site are protected by cryptographic technology.\n4.  You acknowledge that the transmission of information over the Internet is inherently insecure and we cannot guarantee the security of the data transmitted over the Internet.\n5.  You are responsible for keeping the password used to access this site confidential. We do not require your password (except when you log in to this site).\n\n## I. Fix\n\nWe may update this policy from time to time by publishing a new version on this site. Please check this page regularly to understand the policy changes. We may notify you of policy changes via email or our private messaging system.\n\n## J. Customer rights\n\nYou can instruct us to disclose any personal information we hold about you. The following conditions apply to the provision of such information:\n\n1.  Pay the fee (50,000 yen), and\n2.  Providing proper identification (a copy of the passport certified by a notary public and the original utility bill showing your current address).\n\nTo the extent permitted by law, we may withhold the disclosure of personal information requested by you. You have the right to instruct us not to process your personal information for marketing purposes. In practice, we usually provide the opportunity to expressly consent in advance to the use of personal information for marketing purposes or to opt out of the use of personal information for marketing purposes.\n\n## K. Third Party Website\n\nThis site contains hyperlinks to third-party websites and more information about them. We have no control over and are not responsible for third party privacy policies and conduct.\n\n## L. Information update\n\nPlease let us know if we need to correct or update the personal information we hold about you.\n\n## M. cookie\n\nThis site uses cookies. A cookie is a file that contains an identifier (a string of letters and numbers) that is sent by a web server to a web browser and stored by the browser. Then, every time the browser requests a page from the server, the identifier is sent back to the server. Cookies are either \"persistent\" cookies or \"session\" cookies. Persistent cookies are stored by your web browser and are valid until the set expiration date unless deleted by the user before the expiration date. Session cookies, on the other hand, expire at the end of the user session when the web browser is closed. Cookies usually do not contain any personally identifiable information about you, but they do store personal information that is stored in the cookie and may be linked to information obtained from the cookie. We use both session cookies and persistent cookies.\n\n1.  The names of the cookies used on this site and their purposes are as follows.\n\n    1.  Users access websites using computers ・ Track users when navigating websites ・ Use shopping carts ・ Improve website usability ・ Analyze website usage ・ Web Manage your site-Prevent fraud and improve your website's security-Personalize your website by user-Google Analytics on your website to recognize that you're targeting ads that are of particular interest to a particular user And use AdWords.\n\n2.  Most browsers allow you to refuse cookies. for example,\n\n    1.  In Internet Explorer (version 10), you can reject cookies from the cookie processing override settings by clicking Tools> Internet Options> Privacy> Advanced Settings.\n    2.  In Firefox (version 24), click Tools> Options> Privacy, select Use custom settings for history from the drop-down menu, and then select Accept cookies from your site. To do.\n    3.  In Chrome (version 29), go to the \"Customize and Control\" menu, click \"Settings\"> \"Show advanced settings\"> \"Content settings\" and select \"Block sites from settings\". You can block all cookies.\n\nBlocking all cookies adversely affects the usability of many websites. If you block cookies, you will not be able to use all the features of the website.\n\n3.  You can delete cookies that are already stored on your computer. for example,\n\n    1.  Internet Explorer (version 10) requires you to manually delete the cookie file ( [see http://support.microsoft.com/kb/278835](http://support.microsoft.com/kb/278835) for deletion instructions).\n    2.  In Firefox (version 24), click Tools> Options> Privacy, select \"Use custom settings for history\", click \"Show cookies\", and then \"Delete all\". You can click to delete the cookie\n    3.  In Chrome (version 29), go to the \"Customize and Control\" menu, click \"Settings\"> \"Show advanced settings\"> \"Clear browsing data\", then click Cookies and other sites and plugin data. Select Delete and then click \"Clear browsing data\".\n\n4.  Blocking all cookies adversely affects the usability of many websites.\n\n_Update: September 22, 2021_\n","id":"privacy-policy"},"articleHtml":"<h2 id=\"a-introduction\" class=\"font-extrabold tracking-tighter break-word\">A. Introduction</h2>\n<ol>\n<li>The privacy of our users is very important to us and we are committed to protecting it. This policy describes how we handle your personal information.</li>\n<li>By agreeing to use cookies in accordance with the terms of this policy the first time you visit this website, you consent to the use of cookies each time you visit the installation.</li>\n</ol>\n<h2 id=\"b-acknowledgments\" class=\"font-extrabold tracking-tighter break-word\">B. Acknowledgments</h2>\n<p>This document was created using the SEQ Legal (seqlegal.com) template and modified by <a href=\"http://labo.elsoul.nl\" target=\"_blank\" rel=\"noopener noreferrer\">ELSOUL LABO (labo.elsoul.nl).</a></p>\n<h2 id=\"c-collection-of-personal-information\" class=\"font-extrabold tracking-tighter break-word\">C. Collection of personal information</h2>\n<p>The following types of personal information may be collected, stored and used.</p>\n<ol>\n<li>Information about your computer, such as IP address, geographic location, browser type and version, operating system, and more.</li>\n<li>Information about accessing and using this website, such as source, time of visit, page views, and website navigation paths.</li>\n<li>Information such as your e-mail address that you enter when registering on this site.</li>\n<li>Information to be entered when creating a profile on this site, such as name, profile picture, gender, date of birth, dating status such as married / unmarried, interests and hobbies, educational background, work history.</li>\n<li>Information such as the name and email address you enter to subscribe to emails and newsletters.</li>\n<li>Information to enter while using the service on this site.</li>\n<li>Information generated while using this site. Includes information such as when, how often, and under what circumstances.</li>\n<li>Information about what you purchased, the services you used, or the transactions you made through this site. Includes name, address, phone number, email address and credit card details.</li>\n<li>Information that customers post on this site for the purpose of publishing it on the Internet. Includes username, profile picture, and posted content.</li>\n<li>Information contained in communications you send to us via email or this site. Includes communication content and metadata.</li>\n<li>Other personal information you send to us.</li>\n</ol>\n<p>Before you disclose the personal information of another person to us, you must obtain that person's consent for both the disclosure and processing of that personal information in accordance with this policy.</p>\n<h2 id=\"d-use-of-personal-information\" class=\"font-extrabold tracking-tighter break-word\">D. Use of personal information</h2>\n<p>Personal information sent to us through this site will be used for the purposes specified in this policy or related pages of the website. We may use your personal information for the following purposes.</p>\n<ol>\n<li>For management of this site and management of business.</li>\n<li>To personalize our site for you.</li>\n<li>To enable the use of services available on this site.</li>\n<li>To send products purchased from this site.</li>\n<li>To provide services purchased through this site.</li>\n<li>To send statements, invoices, payment notices and accept payments.</li>\n<li>To send communications for non-marketing purposes.</li>\n<li>To send email notifications requested by you.</li>\n<li>If you request, we will send you a newsletter by email (you can unsubscribe at any time when you no longer need the newsletter).</li>\n<li>To send marketing related to our business or the business of a carefully selected third party that you may be interested in by mail or, if you specifically agree to this, by email or similar technology. (Please contact us whenever you no longer need marketing communications).</li>\n<li>To provide statistical information about users of this site to third-party businesses (however, third-party businesses cannot identify users from that information).</li>\n<li>To respond to inquiries and complaints from customers related to this site.</li>\n<li>To keep our site safe and prevent fraud.</li>\n<li>To verify compliance with the Terms of Service governing the use of this site (including monitoring private messages sent through our private messaging services).</li>\n<li>Other uses.</li>\n</ol>\n<p>Privacy settings can be used to limit the disclosure of information on this site and can be adjusted using the privacy controls of the website. We will not provide your personal information to third parties or other third parties for direct marketing without your explicit consent.</p>\n<h2 id=\"e-disclosure-of-personal-information\" class=\"font-extrabold tracking-tighter break-word\">E. Disclosure of personal information</h2>\n<p>We may disclose personal information to employees, officers, insurance companies, professional advisors, agents, suppliers, or subcontractors if reasonably necessary for the purposes described in this policy. We may disclose personal information to members of the Group (that is, subsidiaries, ultimate holding companies, and all of them) if reasonably necessary for the purposes described in this policy.</p>\n<ol>\n<li>To the extent required by law</li>\n<li>If related to ongoing or future legal proceedings</li>\n<li>To establish, exercise, or defend our legal rights (including providing information to others to prevent fraud and reduce credit risk).</li>\n<li>To purchasers (or prospective buyers) of businesses or assets that we sell (or are considering selling)</li>\n<li>In our reasonable opinion, we reasonably believe that such courts or authorities may apply to the court or other competent authority to disclose their personal information if it may reasonably decide to disclose it. To the person</li>\n</ol>\n<p>We may disclose personal information.</p>\n<p>We will not provide your personal information to third parties except as provided in this policy.</p>\n<h2 id=\"f-international-data-communication\" class=\"font-extrabold tracking-tighter break-word\">F. International data communication</h2>\n<ol>\n<li>The information we collect may be stored, processed and transferred in any of the countries in which we operate in order to make the information available in accordance with this policy.</li>\n<li>The information we collect may be transferred to the following countries that do not have data protection laws equivalent to those enforced in European economies: United States, Russia, Japan, China, India.</li>\n<li>Personal information published on this site or personal information sent for publication on this site may be available worldwide via the Internet. We cannot prevent the use or misuse of such information by others.</li>\n</ol>\n<h2 id=\"g-retention-of-personal-information\" class=\"font-extrabold tracking-tighter break-word\">G. Retention of personal information</h2>\n<ol>\n<li>Section G sets out data retention policies and procedures designed to ensure compliance with our legal obligations regarding the retention and deletion of personal information.</li>\n<li>Personal information that we process for any purpose will not be retained for longer than that purpose or the period required for those purposes.</li>\n<li>We generally remove personal information that falls into the categories specified below at the dates and times specified below without violating Section G2. 1. Personal information will be deleted after half a year.</li>\n<li>Notwithstanding the other provisions of Section G</li>\n<li>To the extent required by law</li>\n<li>If the document appears to be related to ongoing or future legal proceedings, and</li>\n<li>To establish, exercise or defend our legal rights (including providing information to others to prevent fraud and reduce credit risk). We hold documents containing personal information (including electronic documents).</li>\n</ol>\n<h2 id=\"h-security-of-personal-information\" class=\"font-extrabold tracking-tighter break-word\">H. Security of personal information</h2>\n<ol>\n<li>We will take reasonable technical and systematic precautions to prevent the loss, misuse, or falsification of your personal information.</li>\n<li>All personal information provided by you is stored on a secure (password and firewall protected) server.</li>\n<li>All electronic financial transactions made through this site are protected by cryptographic technology.</li>\n<li>You acknowledge that the transmission of information over the Internet is inherently insecure and we cannot guarantee the security of the data transmitted over the Internet.</li>\n<li>You are responsible for keeping the password used to access this site confidential. We do not require your password (except when you log in to this site).</li>\n</ol>\n<h2 id=\"i-fix\" class=\"font-extrabold tracking-tighter break-word\">I. Fix</h2>\n<p>We may update this policy from time to time by publishing a new version on this site. Please check this page regularly to understand the policy changes. We may notify you of policy changes via email or our private messaging system.</p>\n<h2 id=\"j-customer-rights\" class=\"font-extrabold tracking-tighter break-word\">J. Customer rights</h2>\n<p>You can instruct us to disclose any personal information we hold about you. The following conditions apply to the provision of such information:</p>\n<ol>\n<li>Pay the fee (50,000 yen), and</li>\n<li>Providing proper identification (a copy of the passport certified by a notary public and the original utility bill showing your current address).</li>\n</ol>\n<p>To the extent permitted by law, we may withhold the disclosure of personal information requested by you. You have the right to instruct us not to process your personal information for marketing purposes. In practice, we usually provide the opportunity to expressly consent in advance to the use of personal information for marketing purposes or to opt out of the use of personal information for marketing purposes.</p>\n<h2 id=\"k-third-party-website\" class=\"font-extrabold tracking-tighter break-word\">K. Third Party Website</h2>\n<p>This site contains hyperlinks to third-party websites and more information about them. We have no control over and are not responsible for third party privacy policies and conduct.</p>\n<h2 id=\"l-information-update\" class=\"font-extrabold tracking-tighter break-word\">L. Information update</h2>\n<p>Please let us know if we need to correct or update the personal information we hold about you.</p>\n<h2 id=\"m-cookie\" class=\"font-extrabold tracking-tighter break-word\">M. cookie</h2>\n<p>This site uses cookies. A cookie is a file that contains an identifier (a string of letters and numbers) that is sent by a web server to a web browser and stored by the browser. Then, every time the browser requests a page from the server, the identifier is sent back to the server. Cookies are either \"persistent\" cookies or \"session\" cookies. Persistent cookies are stored by your web browser and are valid until the set expiration date unless deleted by the user before the expiration date. Session cookies, on the other hand, expire at the end of the user session when the web browser is closed. Cookies usually do not contain any personally identifiable information about you, but they do store personal information that is stored in the cookie and may be linked to information obtained from the cookie. We use both session cookies and persistent cookies.</p>\n<ol>\n<li>\n<p>The names of the cookies used on this site and their purposes are as follows.</p>\n<ol>\n<li>Users access websites using computers ・ Track users when navigating websites ・ Use shopping carts ・ Improve website usability ・ Analyze website usage ・ Web Manage your site-Prevent fraud and improve your website's security-Personalize your website by user-Google Analytics on your website to recognize that you're targeting ads that are of particular interest to a particular user And use AdWords.</li>\n</ol>\n</li>\n<li>\n<p>Most browsers allow you to refuse cookies. for example,</p>\n<ol>\n<li>In Internet Explorer (version 10), you can reject cookies from the cookie processing override settings by clicking Tools> Internet Options> Privacy> Advanced Settings.</li>\n<li>In Firefox (version 24), click Tools> Options> Privacy, select Use custom settings for history from the drop-down menu, and then select Accept cookies from your site. To do.</li>\n<li>In Chrome (version 29), go to the \"Customize and Control\" menu, click \"Settings\"> \"Show advanced settings\"> \"Content settings\" and select \"Block sites from settings\". You can block all cookies.</li>\n</ol>\n</li>\n</ol>\n<p>Blocking all cookies adversely affects the usability of many websites. If you block cookies, you will not be able to use all the features of the website.</p>\n<ol start=\"3\">\n<li>\n<p>You can delete cookies that are already stored on your computer. for example,</p>\n<ol>\n<li>Internet Explorer (version 10) requires you to manually delete the cookie file ( <a href=\"http://support.microsoft.com/kb/278835\" target=\"_blank\" rel=\"noopener noreferrer\">see http://support.microsoft.com/kb/278835</a> for deletion instructions).</li>\n<li>In Firefox (version 24), click Tools> Options> Privacy, select \"Use custom settings for history\", click \"Show cookies\", and then \"Delete all\". You can click to delete the cookie</li>\n<li>In Chrome (version 29), go to the \"Customize and Control\" menu, click \"Settings\"> \"Show advanced settings\"> \"Clear browsing data\", then click Cookies and other sites and plugin data. Select Delete and then click \"Clear browsing data\".</li>\n</ol>\n</li>\n<li>\n<p>Blocking all cookies adversely affects the usability of many websites.</p>\n</li>\n</ol>\n<p><em>Update: September 22, 2021</em></p>","title":"Privacy policy | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes","seoData":[{"property":"og:title","content":"Privacy policy | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes"},{"name":"twitter:title","content":"Privacy policy | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes"},{"name":"twitter:text:title","content":"Privacy policy | solv - An Open-Source Tool for Easily Setting Up and Effortlessly Managing Solana Validators and RPC Nodes"},{"name":"description","content":"Privacy Policy"},{"property":"og:description","content":"Privacy Policy"},{"name":"twitter:description","content":"Privacy Policy"},{"property":"og:url","content":"https://solv.epics.dev/en/legal/privacy-policy"},{"property":"og:image","content":"https://solv.epics.dev/ogp.png"},{"property":"og:image:secure","content":"https://solv.epics.dev/ogp.png"},{"name":"twitter:image","content":"https://solv.epics.dev/ogp.png"}],"_nextI18Next":{"initialI18nStore":{"en":{"common":{"contactToTeam":"Talk with Team","privacy":"Privacy","404title":"Page not found","404body":"Sorry, we couldn't find the page you're looking for.","backToTop":"Back to top page","toc":"Table of Contents","openMenu":"Open menu","closeMenu":"Close menu","media":"Media","news":"News","books":"Books","copy":"Copy","copied":"Copied!","solvInstall":"Install solv","updateSettings":"Update settings","setupSolv":"Setup","thatsAll":"That's all!","navs":{"defaultMainNav":{"quickstart":"Quickstart","news":"News","doc":"Docs","dao":"DAO","enterprise":"Enterprise","contact":"Contact"},"commonFooterNav":{"quickstart":"Quickstart","news":"News","doc":"Docs","enterprise":"Enterprise","dao":"DAO","contact":"Contact","privacy":"Privacy","press-kits":"Press Kits"}},"AgreeToPolicy":{"title":"Your Choices Regarding Cookies","body":"We and our third party partners use cookies and similar technologies to process certain information, such as your IP address and digital identifiers, to analyze site usage and provide you better experiences. Please read our privacy policy for the detail.","yes":"Yes, I Accept","no":"No, I Do Not Accept"},"ContactRow":{"discord":{"title":"Community Discord","body":"If you have any inquiries, please create a support ticket in the community Discord.","button":"JOIN"},"form":{"title":"Talk with Team","body":"If you have any inquiries about development and support, please get in touch with us from here.","button":"Go"}},"CTASectionRow":{"title":"The utility tool for Solana Validators","body":"solv is an open-source tool designed to simplify the setup and operation of Solana validators and RPC nodes.","button":"Get Started","demo":"Try Demo"},"WhyOpenSourceDevelopmentRow":{"subtitle":"Why Open-Source Software?","title":"Sustainable technology development and benefits for society as a whole","description":"Open-source software (OSS) development drives technological progress in modern society and enables new value creation.","feature1":{"title":"Value as a public good","description":"Open-source software is free for anyone to use, improve, and redistribute. This makes OSS a public good for all mankind. People all over the world can enjoy its value without feeling financially constrained. As a result, innovation across society will be driven, and the equality and inclusiveness of the digital society will increase."},"feature2":{"title":"Global cooperation","description":"In the world of OSS, developers all over the world work together to improve software beyond the boundaries of regions and organizations. Each person's perspective and expertise can be incorporated into the project, enhancing its quality. OSS is truly a global gathering place of knowledge and experience that consistently produces high-quality software."},"feature3":{"title":"Preventing reinvention of the wheel","description":"OSS allows us to reuse code and prevents us from reinventing the wheel. As a result, developers can focus less on creating everything from scratch and more on solving specific problems and developing new features. This increases efficiency and enables faster higher-quality results."}},"RoadmapRow":{"2022.6":"Epics Lite Paper, TGE (Token Generate Event)","2022.7":"Epics GENESIS presale","2022.8":"Epics White Paper v1","2022.9":"Epics Alpha launch, Solana Summer Camp Hackathon 5th prize","2022.10":"Presale for IDO, WBSO (Advanced R&D) certified by the Dutch government","2022.11":"Solana Breakpoint, GitHub issue Data Oracle Collaborative Development (DIA)","2023.1":"IDO $EPCT on Orca (Solana DEX)","2023.4":"Epics DAO became a Solana Testnet Validator","2023.9":"Seed Extension Round Fundraising","2023.12":"Epics Platform Beta Launch","2024.2":"$EPCT Listed on Meteora (Solana DEX)","2024.4":"NFT Card Design Reveal, NICONICO CHOKAIGI 2024, ENASE 2024","2024.5":"Epics DAO became a Solana mainnet validator","2024.8":"NFT Card Game β Test Begins, WebX 2024","2024.10":"Series A fundraising, EPCD Exchange Launch","2025.4":"Major Release of Epics Platform, General Release of the NFT Card Game","2025.9":"Series B Fundraising","2026.4":"IEO $EPCT"},"OurWorksRow":{"WBSO":{"title":"WBSO accreditation from the Dutch government","description":"Epics DAO has received WBSO (Advanced Science and Technology Research) accreditation from the Dutch government. Epics is a social contribution blockchain game (BCG) that aims to realize a sustainable open-source development environment."},"SolanaValidator":{"title":"We operate a validator for the Solana blockchain","description":"As a validator on the Solana chain, Epics DAO is committed to ensuring the reliability and stability of the network. We will also contribute to the technical aspects of achieving Solana's fast and stable network."},"SolanaSummerCamp":{"title":"Placed 5th at Solana Summer Camp Hackathon 2022","description":"Epics DAO won 5th place out of over 18,000 entries at the Solana Summer Camp Hackathon held July 11-August 16, 2022."},"GoogleWeb3":{"title":"ELSOUL LABO has been certified by Google Web3 Startups program","description":"ELSOUL LABO's activities in the Web3 sector, including Epics DAO, and support for open-source development initiatives such as solv and Skeet, have been recognized and selected for the Google Cloud Web3 Startups program."},"ENASE2024":{"title":"Research Paper on AI & Serverless 'Skeet' Accepted for ENASE 2024","description":"The research paper 'Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development' has been accepted for presentation at the international conference on software engineering, ENASE 2024."},"CHOKAIGI2024":{"title":"Epics DAO Exhibits at CHOKAIGI 2024","description":"Epics DAO exhibited at CHOKAIGI 2024, held on April 27th - 28th, 2024, distributing limited edition NFTs and more. With a total attendance of 125,362 visitors, the event concluded successfully."},"WebX2024":{"title":"Epics DAO is a WebX 2024 Sponsor","description":"WebX 2024 is the largest event in Asia focused on cutting-edge technologies in Web3, including cryptocurrencies and blockchain. It is the only conference where government bodies, established companies, IP firms, and Web3 businesses can interact."}},"SolvTutorialYouTubeRow":{"title":"Complete Guide to Solana Validators","subtitle":"YouTube Tutorial","description":"We have released a comprehensive guide to easily start operating a Solana validator using solv. For those already running a Solana validator, you can easily switch to solv to benefit from no-downtime transitions and accelerated snapshot downloads."},"SolanaBreakpointSideEventRow":{"title":"Solana Validator Hands-On Workshop","description":"Join us to explore the realm of Solana Validators! This beginner-friendly workshop allows you to launch a Solana Validator using Latitude's cloud servers. Validators process transactions and secure the network, earning rewards. You'll get hands-on experience, unraveling the operational essence of validators while enjoying event-exclusive free credits. It's a chance to learn, interact, and dive into the incentivized world of Solana Validators. Looking forward to engaging in discussions. See you there!","link":"Event Detail"},"LatitudeCouponRow":{"subtitle":"Try it now on Bare Metal Cloud","title":"Latitude Trial Credit Coupon","description":"Through our partnership with Latitude, we are now able to offer a $100 credit coupon. By utilizing this coupon, you can actually try out launching a Solana validator with solv at hand right now.","register":"Register Coupon","couponCode":"Coupon Code"},"StakeForOpenSourceRow":{"subtitle":"Stake for the future of Open-Source Development","title":"Let's support Open-Source Development while earning staking rewards.","description":"※ These are not intended for investment advice. The information are based on the situation at the time of writing. Please check for the most current information. Always NFA/DYOR.","feature1":{"title":"Solana Mainnet Validator","description":"Epics DAO operates a Solana mainnet validator with a 0% fee for users who stake their SOL tokens, resulting in a stake reward with an annual percentage rate (APR) of 7.58% as of May 16, 2024. To contribute to the decentralization of the Solana network and enable innovation worldwide, we will focus our operations in areas with fewer nodes and data centers.","button":"Go to Validator Detail"},"feature2":{"title":"Buidlers Collective (BDLC) NFT","description":"When you stake BDLC NFTs on the Epics platform, you can earn $EPCT token rewards. Additionally, an equivalent amount of $EPCT is donated to the open-source project where the NFTs are staked, to be used for future development. This initiative utilizes blockchain technology to enable socially beneficial NFT staking and No Loss Donation, where staking rewards are donated without losing the principal.","button":"Go to NFT Marketplace"}},"NicoNicoChoKaigi2024Row":{"subtitle":"Cho Dice Roll in NICONICO CHOKAIGI 2024","title":"Thank you for visiting!","description":"Epics DAO participated in Nico Nico Chokaigi 2024, held at Makuhari Messe on April 27th and 28th, and distributed limited edition NFTs to visitors. The event attracted a total of 125,362 attendees, with about 3,000 people visiting the Epics DAO Cho Dice Roll booth, successfully concluding the event with great fanfare."},"WebX2024Row":{"title":"WebX 2024 Sponsor Confirmed","description":"Epics DAO will participate as a sponsor at WebX 2024. WebX is the largest event in Asia focused on cutting-edge technologies in Web3, including cryptocurrencies and blockchain. It is the only conference where government bodies, established companies, IP firms, and Web3 businesses can interact.","discountLink":"Sponsor Discount Tickets"}},"legal":{}}},"initialLocale":"en","ns":["common","legal"],"userConfig":{"i18n":{"defaultLocale":"en","locales":["en","ja"]},"default":{"i18n":{"defaultLocale":"en","locales":["en","ja"]}}}}},"__N_SSG":true}